Dlubal.RFEM5.LineHinge
Line hinge parameters

Dlubal.RFEM5.LineHinge.No
Number

Dlubal.RFEM5.LineHinge.ID
Identifier

Dlubal.RFEM5.LineHinge.Comment
Comment

Dlubal.RFEM5.LineHinge.Tag
Tag

Dlubal.RFEM5.LineHinge.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.LineHinge.LineNo
Number of the line on which is the hinge placed

Dlubal.RFEM5.LineHinge.SurfaceNo
Number of the surface on which is the hinge placed

Dlubal.RFEM5.LineHinge.Side
Side of line

Dlubal.RFEM5.LineHinge.TranslationalConstantX
Translational release ux

Dlubal.RFEM5.LineHinge.TranslationalConstantY
Translational release uy

Dlubal.RFEM5.LineHinge.TranslationalConstantZ
Translational release uz

Dlubal.RFEM5.LineHinge.RotationalConstantX
Rotational release φx

Dlubal.RFEM5.LineHinge.RotationalConstantY
Rotational release φy

Dlubal.RFEM5.LineHinge.RotationalConstantZ
Rotational release φz